{
    "locale": {
        "en": "English",
        "da": "Danish",
        "ja": "Japanese"
    },

    "nav": {
        "skills": "Skills",
        "projects": "Projects",
        "about": "About me",
        "contact": "Contact"
    },

    "header": {
        "sej": "Syntax Error Jedi",
        "desc":"I can offer SEJ Syntax Error Jedi specializing in frontend, backend and Figma and it's fitting that my name is Stefan Emil Jespersen",
        "intro": "Hi",
        "iam": "I'm",
        "name": "Stefan",
        "experience": "I have experience in:"
    },

    "skills": {
        "title": "Skills",
        "c_language": "Languages",
        "frameworks": "Frameworks",
        "databases": "Databases",
        "o_tools": "Other tools"
    },

    "projects": {
        "title": "Featured Projects",
        "all_title": "All Projects",
        "sejs_pizza": "A web app for a shopping site where customers can select their orders, and then buy them. My goal is to create a simple yet easy to use shopping site. I'm working on creating the backend so it actually functions, but for now I've only done the front-end. The app is build in React.js and JavaScript.",
        "recraft_mobile": "This is a project which I've been working on for about 4 weeks at my work for ReCraft. The prototype is for a re-design of their old (current) app. I've been shown the hi-fi designs in Canvas, and my job was to implement a functioning prototype in Figma. This prototype includes almost every page which will be implemented.",
        "rtid": "RTID by LUDO is a shopping site in which people can buy Scarfs and other items created and made by people in need in Thailand. I've been working on both the .com and the .asia sites. The aim was to show/display the items in a way that catches customers attention while also show them RTID by LUDO's misson.",
        "llr": "A re-design website for Lifeline Roboitcs. They were unsatisfied with their current website so me and a colleague was tasked to re-design it. As the time was limited and it was an internship it was never finished fully, that's why the website is not perfect. We worked in WordPress and PHP.",
        "wbd": "An application for a buying flow. This was for a bachelor project where the client was the Danish company, Webdock. Webdock is a company which sells servers to their customers. The goal for the app was to make the it as easy as possible for customers to buy servers part, while also help them teach things, if they didn't understand everything.",
        "recraft_website": "A lo-fi wireframe for a re-design of ReCraft's current website. I've been studying and taking inspirations from various other websites when creating this prototype. The main goal was to a sort of 'call-to-action' for people to download their app, which is where the ReCraft got their marketplace.",
        "nordbo_robotics": "An exam project that my group and I did for the client 'Nordbo Robotics'. The idea was to find out how to teach customers how to use the robots in the best possible way. Our idea was to create a tutorial app where users could easily and clearly learn how to use the robots, and to implement a little gamification.",
        "ucl": "Exam project where my group and I were tasked with improving the school's student counseling process when students apply for guidance. We succeeded in making it more user-friendly and we also received praise for it. The school ended up using some of our design for their final product!",
        "read_more": "Read more",
        "see_all": "See All"
    },

    "about": {
        "title": "About me",
        "undertitle": "One man's dream - the dream of going out there and make a difference",
        "motivation": "I have always dreamed of go out and work together with a bunch of amazing people and make exciting projects together!",
        "desc1": "As you already know by now I'm Stefan and I'm currently looking for a place to work to utilize my experience.",
        "desc2": "I have a Bachelor Degree in Web Development and a Academy Profession (AP) Degree in Multimedia Design, both at UCL University College Lillebælt.",
        "desc3": "I am currently working on this portfolio, a pizza delivery website and other minor projects.",
        "desc4": "I'm experienced in fullstack development - I dabble with Vue, ReactJS and TypeScript as frontend. With backend it's Google firebase, Azure SQL and MongoDB."
    },

    "contact": {
        "title": "Let's get in Touch!",
        "name": "name",
        "email": "Email",
        "message": "Message",
        "send_btn": "Send message"
    },

    "footer": {
        "made_by": "Made personally by Stefan E. J."
    },

    "project_vue": {
        "title": "Work in Progress",
        "back": "Go Back"
    }
}