{
    "locale": {
        "en": "English",
        "da": "Danish",
        "ja": "Japanese"
    },
    "nav": {
        "projects": "Projects",
        "about": "About me",
        "contact": "Contact"
    },
    "header": {
        "intro": "Hi",
        "iam": "I'm",
        "name": "Stefan",
        "experience": "I have experience in:"
    },
    "projects": {
        "header": "Featured Projects",
        "sejs_pizza": "A web app for a shopping site where customers can select their orders, and then buy them. My goal is to create a simple yet easy to use shopping site. I'm working on creating the backend so it actually functions, but for now I've only done the front-end. The app is build in React.js and JavaScript.",
        "recraft_mobile": "This is a project which I've been working on for about 4 weeks at my work for ReCraft. The prototype is for a re-design of their old (current) app. I've been shown the hi-fi designs in Canvas, and my job was to implement a functioning prototype in Figma. This prototype includes almost every page which will be implemented.",
        "rtid": "RTID by LUDO is a shopping site in which people can buy Scarfs and other items created and made by people in need in Thailand. I've been working on both the .com and the .asia sites. The aim was to show/display the items in a way that catches customers attention while also show them RTID by LUDO's misson.",
        "llr": "A re-design website for Lifeline Roboitcs. They were unsatisfied with their current website so me and a colleague was tasked to re-design it. As the time was limited and it was an internship it was never finished fully, that's why the website is not perfect. We worked in WordPress and PHP.",
        "wbd": "An application for a buying flow. This was for a bachelor project where the client was the Danish company, Webdock. Webdock is a company which sells servers to their customers. The goal for the app was to make the it as easy as possible for customers to buy servers part, while also help them teach things, if they didn't understand everything.",
        "recraft_website": "A lo-fi wireframe for a re-design of ReCraft's current website. I've been studying and taking inspirations from various other websites when creating this prototype. The main goal was to a sort of 'call-to-action' for people to download their app, which is where the ReCraft got their marketplace.",
        "ucl": "This is a website made for an exam.",
        "read_more": "Read more",
        "see_all": "See All",
        "view_prototype": "View prototype",
        "visit_web": "Visit Website",
        "git_btn": "Visit GIT repo"
    },
    "about": {
        "title": "About me",
        "desc1": "I am a graduate of University College Lillebælt (UCL), holding a degree in Web Development and Multimedia Design. My academic background has provided me with a solid foundation in both creative and technical disciplines, including proficiency in industry-standard tools such as Adobe Creative Suite, as well as coding and various evaluation techniques that are essential in today's professional landscape.",
        "desc2": "Through my work experience, I have developed a strong understanding of the professional environment, honing my ability to maintain focus, adapt to challenges, and deliver results effectively."
    },
    "contact": {
        "title": "Let's get in Touch!",
        "name": "name",
        "email": "Email",
        "message": "Message",
        "send_btn": "Send message"
    },
    "footer": {
        "made_by": "Made personally by Stefan E. J."
    }
}