{
    "locale": {
        "en": "英語",
        "da": "デンマーク語",
        "ja": "日本語"
    },
    "nav": {
        "skills": "スキル",
        "projects": "プロジェクト",
        "about": "私について",
        "contact": "コンタクト"
    },
    "header": {
        "sej": "ソフトウェア・エンジニア・ジェダイ",
        "desc":"私が提供できるのは、ソフトウェアエンジニアとしてのスキルです。フロントエンドやバックエンド、そしてFigmaを専門としています。私の名前が",
        "name": "ステファン・エミール・イェスペルセン",
        "extionsion": "であることはふさわしいと思います。",
        "experience": "私には経験がある："
    },
    "skills": {
        "title": "スキル",
        "c_language": "コード言語",
        "frameworks": "フレームワーク",
        "databases": "データベース",
        "o_tools": "他のツール",
        "adobe": "アドビ",
        "design": "デザイン"
    },

    "projects": {
        "title": "注目のプロジェクト",
        "all_title": "全てプロジェクト",
        "sejs_pizza": "顧客が注文を選択し、購入できるショッピングサイトのウェブアプリ。私の目標は、シンプルで使いやすいショッピングサイトを作ることです。実際に機能するようにバックエンドの制作に取り組んでいますが、今のところフロントエンドしかできていません。アプリはReact.jsとJavaScriptで作られている。",
        "recraft_mobile": "これはReCraftのプロジェクトで、4週間ほど前から職場で取り組んでいる。プロトタイプは、彼らの古い（現在の）アプリの再設計のためのものです。私はCanvasでハイファイなデザインを見せてもらい、私の仕事はFigmaで機能するプロトタイプを実装することでした。このプロトタイプには、実装されるほぼすべてのページが含まれています。",
        "rtid": "RTID by LUDOは、タイで困っている人たちによって作られたスカーフやその他のアイテムを購入できるショッピングサイトです。私は.comと.asiaの両方のサイトに携わってきました。その目的は、RTID by LUDOのミスソンを伝えると同時に、顧客の注意を引くような方法でアイテムを表示することでした。",
        "llr": "Lifeline Roboitcsのウェブサイトのリデザイン。彼らは現在のウェブサイトに満足していなかったので、私と同僚が再設計することになった。時間が限られており、インターンシップだったため、完全には完成しませんでした。私たちはWordPressとPHPを使って仕事をしました。",
        "wbd": "購買フローのアプリケーション。これは、デンマークのWebdock社をクライアントとする独身プロジェクト用でした。Webdockは顧客にサーバーを販売する会社です。このアプリのゴールは、顧客がサーバーを購入するのをできるだけ簡単にすることであり、同時に、もし顧客がすべてを理解していない場合は、いろいろなことを教えられるようにすることでした。",
        "recraft_website": "ReCraftの現在のウェブサイトをリデザインするためのローファイなワイヤーフレーム。このプロトタイプを作成する際に、他の様々なウェブサイトからインスピレーションを得ました。主な目標は、人々がアプリをダウンロードするための「コール・トゥ・アクション」のようなもので、リクラフトはそこからマーケットプレイスを得ている。",
        "nordbo_robotics": "私のグループと私が「Nordbo Robotics」というクライアントのために行った試験プロジェクト。ロボットの使い方を顧客に最適な方法で教える方法を見つけることでした。私たちのアイデアは、ユーザーがロボットの使い方を簡単かつ明確に学べるチュートリアルアプリを作成し、ちょっとしたゲーミフィケーションを実装することでした。",
        "ucl": "私のグループと私は、学生がガイダンスに申し込む際の学校の学生相談プロセスを改善することを課された試験プロジェクトに参加しました。私たちは、より使いやすいものにすることに成功し、また、それに対する賞賛もいただきました。最終的に、学校は私たちのデザインの一部を最終製品に使用することになりました！",
        "read_more": "もっと読む",
        "see_all": "もっと見る",
        "buttons": {
            "github": "コードを見る",
            "live": "ウェブサイトへ",
            "figma": "プロトタイプを見る"
        },
        "details": {
          "sejs_pizza": {
            "undertitle": "ピザを注文するウェブサイト",
            "summary": "Sej'sピザは、私が現在行っている趣味のプロジェクトです。ReactJSでコーディング",
            "desc1": "Sej's Pizzaは、シンプルで簡単にピザを注文できる場所である。ウェブサイトはシンプルで分かりやすいデザインで、ユーザーが簡単にナビゲートできるようになっている。",
            "desc2": "このウェブサイトはReactJSとJavaScriptでコーディングされているので、ウェブサイトを作るのは簡単です。宅配ピザを提供している他のウェブサイトをリサーチすることから始め、さらにFigmaでワイヤーフレームのスケッチを始めました。",
            "desc3": "まだバックエンドをやらなければならないが、すでに多くのことを学んだ。Reactでのコーディングだけでなく、ユーザー体験を向上させるウェブサイトのデザインという点でも。"
          },
          "recraft_mobile": {
            "undertitle": "ReCraftの旧モバイル・アプリケーションの再設計",
            "summary": "Figmaで作ったリクラフトのアプリのプロトタイプ。シンプルで良いデザインに仕上がり、ReCraftの同僚たちも大満足でした。",
            "desc1": "リクラフトのリーダーたちは、現在のアプリのデザイン、パフォーマンスの問題、そしてユーザーからのネガティブなフィードバックにうんざりしていた。",
            "desc2": "リクラフト社から、Figmaで新しいインタラクティブなプロトタイプを作るように依頼されました。私が来る前は、デザインを変更するフリーランサーを雇っていたため、小さな衝突が生じていました。そのため、私の仕事は、新しいアプリの再設計は、彼らのフィードバックや意見を反映させながら行うべきだということを、リクラフトと協力して伝えることでした。",
            "desc3": "リクラフトの素晴らしい人たちから素晴らしいフィードバックをもらい、直感的で良いデザインを作ることができました。多くのことを学び、リクラフトでの経験にとても満足しています。"
          },
          "rtid": {
            "undertitle": "WordPressショッピングサイト",
            "summary": "RTID by LUDOには、.comと.asiaの2つのサイトがあります。私の友人と私は、.comサイトのデザインを変更し、WordPressでゼロから.asiaサイトを作成するために一緒に働いています。",
            "desc1": "私の友人にビジネスを営む知人がいた。その人は、ワードプレスで新しいウェブサイトをデザインし、構築する手助けが必要だった。友人と私は、この挑戦を素直に引き受けた。",
            "desc2": "私たちが最初に取り組んだのは、.comサイトの再設計と修正でした。それが終わると、私たちは.asiaサイトから再スタートしました。私たちはアジアのトレンドと極東でのウェブサイトの作り方を研究しました。",
            "desc3": "私たちは、WordPressのウェブサイトを再設計し、新たに作成することに成功しました。課題はありましたが、継続することでシンプルで素敵なウェブサイトが完成しました。"
          },
          "llr": {
            "undertitle": "WordPress ウェブサイトのデザイン変更",
            "summary": "ライフライン・ロボティクス社でのインターンシップ中、同僚と私は、彼らが不満に思っていた古いワードプレスのウェブサイトを再設計しなければならなかった。",
            "desc1": "ライフライン・ロボティクスの同僚が、インターン仲間と私に、現在のウェブサイトのデザインを変更したいと伝えてきた。",
            "desc2": "私たちはすぐにリサーチを始め、他のロボット・サイトのトレンドを研究しました。2人ともWordPressは比較的初心者でしたが、素敵なフローを作り、ユーザーが初めてウェブサイトを見たときにどう思うかを常に考えていました。",
            "desc3": "残念ながらインターンシップは終了し、ライフライン・ロボティクスとの連絡も途絶え始めた。それでも、他の人たちと協力し、自分自身の効率を高めながら、多くのことを学ぶことができた。"
          },
          "wbd": {
            "undertitle": "ウェブドック購入の流れ",
            "summary": "友人と私はウェブドックをクライアントに持ち、VueとREST_APIを使って購入フローとして共有するページをコーディングしなければなりませんでした。私たちは高い評価を得ることができました。",
            "desc1": "Webdockはユーザーにサーバーホスティングを提供する会社だ。友人がこの会社でインターンシップをしていたときに、私たちはこの会社を見つけました。私たちは学士号を持っていたので、クライアントを選ぶのは簡単でした。",
            "desc2": "すぐにウェブドックのCEOと連絡を取り、何度かミーティングを行い、彼が経験している問題や彼が望んでいることを聞きました。私たちは、どのフレームワークがこのプロジェクトに最も適しているかを調査し、その結果がVueでした。",
            "desc3": "ユーザーがサーバーパーツを簡単に選択できるように、1ページのウェブサイトを作成しました。ここで私はVueについて本当に学び、Vueでのコーディングを楽しみました。"
          },
          "recraft_website": {
            "undertitle": "ReCraftのウェブサイトをリニューアル",
            "summary": "Figmaで作ったシンプルでローファイなプロトタイプ。私は、トレンドや他の編み物サイトがどのようにウェブサイトを構成しているかを懸命に研究しました。",
            "desc1": "アプリのインタラクティブ・プロトタイプが完成すると、私はすぐにリクラフト・ウェブサイトのリデザインを検討し始めた。再び、他の編み物サイトがどのようにデザインを構成しているのかをリサーチした。",
            "desc2": "しばらくして、Figmaでローファイなプロトタイプを作り始めた。完成したプロトタイプをReCraftに見せたんだ。",
            "desc3": "リクラフトは僕のローファイを気に入ってくれて、いいフィードバックをくれた。"
          },
          "nordbo_robotics": {
            "undertitle": "ユーザー向けビデオチュートリアル",
            "summary": "試験プロジェクトの結果、全員にNordbo Roboticsがクライアントとして与えられました。私のグループと私は、FirebaseとVueを使って、動画を使った教育用ウェブサイトを作ることにしました。",
            "desc1": "Nordbo Roboticsは、自動化を中心とした企業にロボットを販売している会社です。私のグループと私は、どうすればユーザーがロボットをよりよく学べるかを考え始めました。その結果、ユーザーに教えるためのアプリを作ることになりました。",
            "desc2": "プロジェクトはVueで作成され、データベースにはFirebaseを使用した。Vue.ではダイナミック・ルーターが使用され、可能な限り流動的で曖昧さのないエクスペリエンスを実現している。",
            "desc3": "いくつかの問題にぶつかりましたが、完成した製品は私たちの誇りです。その結果、Nordbo Robotics社から、私たちの指導方法を高く評価していただきました。"
          },
          "ucl": {
            "undertitle": "生徒指導インプットの改善",
            "summary": "私のグループと私は、C#とVueでコード化された学校の現在の生徒指導の入力を改善する必要がありました。",
            "desc1": "UCLでは当時、学生ガイダンス入力システムを利用する学生が誤解をしたり、システム全体が混乱していると考えたりする問題があった。",
            "desc2": "私のグループは、彼らのシステムをより良いものにし、曖昧さをなくすことを任された。私たちは、ユーザーが様々な入力を簡単に理解し、それに対してフィードバックできるようなシステムを作りました。さらに、学生カウンセラーが受け取ったフィードバックをより簡単に分類できるように、管理画面を改善しました。",
            "desc3": "新システムは、C#による大規模なプロジェクトでコード化され、ログインシステム、インタラクティブな管理パネル、機能的なフィードバック入力を備えている。"
          }
        }
    },

    "about": {
        "title": "私について",
        "undertitle": "One man's dream - 外に出て変化をもたらすという夢",
        "motivation": "私はいつも、外に出て素晴らしい人たちと一緒に仕事をし、エキサイティングなプロジェクトを一緒に作ることを夢見てきた！",
        "desc1": "もうご存知だと思いますが、私はステファンで、現在、自分の経験を生かせる職場を探しています。",
        "desc2": "私はUCL University College Lillebæltでウェブ開発の学士号とマルチメディア・デザインのアカデミー専門職学位（AP）を取得しています。",
        "desc3": "現在、このポートフォリオや宅配ピザのウェブサイト、その他の細かいプロジェクトに取り組んでいます。",
        "desc4": "フロントエンドではVue、ReactJS、TypeScriptを扱っています。バックエンドはGoogle firebase、Azure SQL、MongoDBです。"
    },

    "contact": {
        "title": "連絡を取ろう！",
        "name": "名前",
        "email": "メール",
        "message": "メッセージ",
        "send_btn": "メッセージ送る"
    },

    "footer": {
        "made_by": "個人製作 Stefan E. J."
    },

    "project_vue": {
        "title": "進行中の作品",
        "back": "戻る"
    }

}